In [7]:
import pandas as pd 
import numpy as np

In [8]:
pd.__version__

'0.23.4'

In [9]:
arr = [0, 1, 2, 3, 4]
df = pd.Series(arr)

In [10]:
df

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [11]:
d = {'a':1,'b':2,'c':3,'d':4,'e':5}
df = pd.Series(d)

In [12]:
df

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [13]:
dates = pd.date_range('today',periods=6) # 定义时间序列作为 index

In [14]:
dates

DatetimeIndex(['2022-03-16 14:30:54.306212', '2022-03-17 14:30:54.306212',
               '2022-03-18 14:30:54.306212', '2022-03-19 14:30:54.306212',
               '2022-03-20 14:30:54.306212', '2022-03-21 14:30:54.306212'],
              dtype='datetime64[ns]', freq='D')

In [15]:
num_arr = np.random.randn(6,4) # 传入 numpy 随机数组

In [16]:
num_arr

array([[-1.34350935, -0.88590228, -1.30656035,  0.57725707],
       [-0.21384364,  0.09136508, -0.18787312,  0.26937727],
       [-1.89394211,  1.49237959, -0.62144687,  2.54641324],
       [ 0.09073808, -0.56433613,  1.41484666,  1.15937306],
       [-0.18970089, -1.85934984, -0.03811011,  0.11128582],
       [-2.18578937,  0.67536138, -1.11976435,  0.25753721]])

In [17]:
columns = ['A','B','C','D'] # 将列表作为列名

In [18]:
columns

['A', 'B', 'C', 'D']

In [19]:
df1 = pd.DataFrame(num_arr, index = dates, columns = columns)

In [20]:
df1

                                   A         B         C         D
2022-03-16 14:30:54.306212 -1.343509 -0.885902 -1.306560  0.577257
2022-03-17 14:30:54.306212 -0.213844  0.091365 -0.187873  0.269377
2022-03-18 14:30:54.306212 -1.893942  1.492380 -0.621447  2.546413
2022-03-19 14:30:54.306212  0.090738 -0.564336  1.414847  1.159373
2022-03-20 14:30:54.306212 -0.189701 -1.859350 -0.038110  0.111286
2022-03-21 14:30:54.306212 -2.185789  0.675361 -1.119764  0.257537

In [21]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

In [22]:
data

{'animal': ['cat',
  'cat',
  'snake',
  'dog',
  'dog',
  'cat',
  'snake',
  'cat',
  'dog',
  'dog'],
 'age': [2.5, 3, 0.5, nan, 5, 2, 4.5, nan, 7, 3],
 'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

In [23]:
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [24]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})

In [25]:
df

    A
0   1
1   2
2   2
3   3
4   4
5   5
6   5
7   5
8   6
9   7
10  7

In [26]:
df1 = df.loc[df['A'].shift() != df['A']]

In [27]:
df1

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

In [28]:
df2 = df.drop_duplicates(subset='A')

In [29]:
df2

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

In [30]:
df = pd.DataFrame(np.random.random(size=(5, 3)))
print(df)

          0         1         2
0  0.529666  0.170104  0.426443
1  0.812644  0.525787  0.535153
2  0.031421  0.566227  0.075784
3  0.953640  0.189972  0.725944
4  0.704881  0.013783  0.125082

In [31]:
df1 = df.sub(df.mean(axis=1), axis=0)

In [32]:
df1

          0         1         2
0  0.154261 -0.205300  0.051039
1  0.188116 -0.098741 -0.089375
2 -0.193056  0.341750 -0.148693
3  0.330455 -0.433214  0.102759
4  0.423633 -0.267466 -0.156167

In [34]:
df = pd.DataFrame(np.random.random(size=(5, 5)), columns=list('abcde'))
df

          a         b         c         d         e
0  0.978940  0.171961  0.872551  0.530195  0.813773
1  0.394530  0.310264  0.466891  0.060962  0.500803
2  0.252044  0.007624  0.591573  0.014746  0.456738
3  0.592188  0.025001  0.143640  0.864797  0.532998
4  0.696055  0.907166  0.047034  0.835149  0.871537

In [35]:
print(df)
df.sum().idxmin()

          a         b         c         d         e
0  0.978940  0.171961  0.872551  0.530195  0.813773
1  0.394530  0.310264  0.466891  0.060962  0.500803
2  0.252044  0.007624  0.591573  0.014746  0.456738
3  0.592188  0.025001  0.143640  0.864797  0.532998
4  0.696055  0.907166  0.047034  0.835149  0.871537

'b'